# Theme
romkatv/powerlevel10k

# Jump around in your shell
rupa/z
# Additional completion definitions for Zsh.
zsh-users/zsh-completions

# Open a file or repository in the web by using the `git open` command
paulirish/git-open

# This adds the zsh-bench function to benchmark the shell startup time.
romkatv/zsh-bench kind:path

# A collection of oh-my-zsh plugins
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/history
ohmyzsh/ohmyzsh path:plugins/composer
ohmyzsh/ohmyzsh path:plugins/bun
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/last-working-dir


# Node Version Manager
lukechilds/zsh-nvm

# Provides syntax highlighting for the shell
zdharma-continuum/fast-syntax-highlighting kind:defer

# Provides suggestions as you type
zsh-users/zsh-autosuggestions kind:defer
